//我们编写C++程序时，我们希望使用数据，大多数编程内容都是使用数据。
//我们使用、修改、读写数据。
//在C++程序中，我们需要一个容器存储数据，那就是变量。
//通俗的说我们将数据存储在变量当中。
//准确的说，变量是我们给储存在内存中数据的一个名字。
//在C++中有一些原始基本数据，他们定义了不同数据类型的变量。变量唯一的不同就是占用多少内存。
//接下来让我们看一下
#include <iostream>

int mian()
{
  int,,char,float,double;
  //这是C++中最常见的数据类型，他们可以定义不同的变量。
  //int 代表整数 char 代表字符型 float和double代表小数，不同在于double是双精度小数
  //除了double为八字节，其余都是四字节内存
  int a;
  a = 8;
  int b = 8；
  //上数代码表示定义了两个int 类型的变量a和b，并将 8 分别存储在a和b当中，两种写法是等效的。
  //除了上述数据类型，C++较C多了一个bool类型
   bool c = true;
  //布尔类型占一个字节内存，要么是false（0）要么是true（1）
}
    
